title: Linux Lateral Movement - SSH ProxyJump Lateral Movement
id: b8ec4d2c-1dae-4879-b147-5b68a2eef195
status: stable
description: Detects SSH ProxyJump Lateral Movement lateral movement technique
author: Thor Security Team
date: 2025/02/01
modified: 2025/06/15
tags:
    - attack.lateral_movement
    - attack.t1021.004
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        CommandLine|contains: 'ProxyJump'
    condition: selection
falsepositives:
    - Legitimate administrators
level: medium
