title: Brute Force Attack - snmp_community_bruteforce
id: 19624399-f899-406c-b5d4-c6f009909587
status: stable
description: Detects brute force authentication attacks targeting snmp_community_bruteforce
author: Thor Security Team
date: 2025/02/01
modified: 2025/06/15
tags:
    - attack.credential_access
    - attack.t1110.001
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        EventType: 'authentication_failure'
        Count|gt: 10
    condition: selection
falsepositives:
    - Password policy enforcement tools
level: medium
