title: Network C2 - Brute Ratel C4
id: dbf07d2e-cf90-4c13-be30-ee392e253b33
status: stable
description: Detects Brute Ratel C4 network communication
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.command_and_control
    - attack.t1071.001
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        DestinationPort:
            - 53
            - 443
            - 80
            - 8080
            - 8443
        CommandLine|contains:
            - 'brute_ratel'
    condition: selection
falsepositives:
    - Legitimate network monitoring tools
level: high
