title: Network C2 - Mythic C2 Framework
id: b227b795-5a37-4cf8-abfb-bb28b50e124c
status: stable
description: Detects Mythic C2 Framework network communication
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.command_and_control
    - attack.t1071.001
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        DestinationPort:
            - 53
            - 443
            - 80
            - 8080
            - 8443
        CommandLine|contains:
            - 'mythic_agent'
    condition: selection
falsepositives:
    - Legitimate network monitoring tools
level: high
