title: Network C2 - Nighthawk C2
id: 02adb8f1-392a-4d05-9324-6119941c57ea
status: stable
description: Detects Nighthawk C2 network communication
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.command_and_control
    - attack.t1071.001
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        DestinationPort:
            - 53
            - 443
            - 80
            - 8080
            - 8443
        CommandLine|contains:
            - 'nighthawk.*beacon'
    condition: selection
falsepositives:
    - Legitimate network monitoring tools
level: high
