title: Network C2 - PoshC2 Framework
id: ba622a61-8d8a-4f25-b78d-b30a1ae7e8ff
status: stable
description: Detects PoshC2 Framework network communication
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.command_and_control
    - attack.t1071.001
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        DestinationPort:
            - 53
            - 443
            - 80
            - 8080
            - 8443
        CommandLine|contains:
            - 'posh_v2_dropper'
    condition: selection
falsepositives:
    - Legitimate network monitoring tools
level: high
