title: Network C2 - Sliver C2 Framework
id: 24ea0f78-e72b-4d73-959f-e1f52b3ffbd8
status: stable
description: Detects Sliver C2 Framework network communication
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.command_and_control
    - attack.t1071.001
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        DestinationPort:
            - 53
            - 443
            - 80
            - 8080
            - 8443
        CommandLine|contains:
            - 'sliver-client'
    condition: selection
falsepositives:
    - Legitimate network monitoring tools
level: high
