title: Network C2 - DNS Tunneling via Iodine
id: 1bc7c15a-9b2f-49ea-879c-16e77ce4922f
status: stable
description: Detects DNS Tunneling via Iodine network communication
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.command_and_control
    - attack.t1071.004
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        DestinationPort:
            - 53
            - 443
            - 80
            - 8080
            - 8443
        CommandLine|contains:
            - 'iodine'
    condition: selection
falsepositives:
    - Legitimate network monitoring tools
level: high
