title: Network Exfiltration - GitHub Repository Exfiltration
id: bedfd6ca-78a3-4ce6-a1d2-7a1d45a62260
status: stable
description: Detects GitHub Repository Exfiltration data exfiltration over network
author: Thor Security Team
date: 2024/11/01
modified: 2025/05/15
tags:
    - attack.exfiltration
    - attack.t1567.001
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        BytesSent|gt: 10000000
    condition: selection
falsepositives:
    - Legitimate large file transfers
    - Backup operations
level: medium
