title: Network Exfiltration - SMTP Attachment Exfiltration
id: e4da8410-fa69-42e8-b047-a11c16ae9dfb
status: stable
description: Detects SMTP Attachment Exfiltration data exfiltration over network
author: Thor Security Team
date: 2024/11/01
modified: 2025/05/15
tags:
    - attack.exfiltration
    - attack.t1048.002
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        BytesSent|gt: 10000000
    condition: selection
falsepositives:
    - Legitimate large file transfers
    - Backup operations
level: medium
