title: Network Exfiltration - BitTorrent Exfiltration
id: 0ff017bd-ae10-47d8-b0a6-7a047114d1e1
status: stable
description: Detects BitTorrent Exfiltration data exfiltration over network
author: Thor Security Team
date: 2024/11/01
modified: 2025/05/15
tags:
    - attack.exfiltration
    - attack.t1048
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        BytesSent|gt: 10000000
    condition: selection
falsepositives:
    - Legitimate large file transfers
    - Backup operations
level: medium
