title: Network C2 - Suspicious HTTPS C2 Certificate
id: 138422d9-16a2-4a44-a0e5-0325cf355642
status: stable
description: Detects Suspicious HTTPS C2 Certificate network communication
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.command_and_control
    - attack.t1071.001
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        DestinationPort:
            - 53
            - 443
            - 80
            - 8080
            - 8443
        CommandLine|contains:
            - 'self-signed.*beacon'
    condition: selection
falsepositives:
    - Legitimate network monitoring tools
level: high
