title: Network Lateral - NTP Amplification/Manipulation
id: 44721479-6530-4861-aa54-6f0dbd3d64e4
status: stable
description: Detects NTP Amplification/Manipulation network attack
author: Thor Security Team
date: 2025/03/01
modified: 2025/06/15
tags:
    - attack.lateral_movement
    - attack.t1498
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
    condition: selection
falsepositives:
    - Network testing tools
level: high
