title: Network Lateral - OSPF Route Injection
id: fb9aa704-f587-4927-897b-9fb9cc7580b3
status: stable
description: Detects OSPF Route Injection network attack
author: Thor Security Team
date: 2025/03/01
modified: 2025/06/15
tags:
    - attack.lateral_movement
    - attack.t1599
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
    condition: selection
falsepositives:
    - Network testing tools
level: high
