title: Network Lateral - IPv6 Rogue Router Advertisement
id: 58964aba-f58e-4c4c-8242-102935486a0a
status: stable
description: Detects IPv6 Rogue Router Advertisement network attack
author: Thor Security Team
date: 2025/03/01
modified: 2025/06/15
tags:
    - attack.lateral_movement
    - attack.t1557
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
    condition: selection
falsepositives:
    - Network testing tools
level: high
