title: Network Lateral - BGP Route Hijacking
id: 9b30a3e4-5d44-458c-a64f-198428aeaef6
status: stable
description: Detects BGP Route Hijacking network attack
author: Thor Security Team
date: 2025/03/01
modified: 2025/06/15
tags:
    - attack.lateral_movement
    - attack.t1599
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
    condition: selection
falsepositives:
    - Network testing tools
level: high
