title: Network Lateral - Spanning Tree Attack
id: 98d11255-714e-4744-b72a-8f733042113f
status: stable
description: Detects Spanning Tree Attack network attack
author: Thor Security Team
date: 2025/03/01
modified: 2025/06/15
tags:
    - attack.lateral_movement
    - attack.t1557
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
    condition: selection
falsepositives:
    - Network testing tools
level: high
