title: Network Lateral - LDAP Password Spray
id: 27f80e1e-f2af-42e8-a842-db9b1684ab07
status: stable
description: Detects LDAP Password Spray network attack
author: Thor Security Team
date: 2025/03/01
modified: 2025/06/15
tags:
    - attack.lateral_movement
    - attack.t1110.003
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
    condition: selection
falsepositives:
    - Network testing tools
level: high
