title: Network Lateral - STP Root Bridge Attack
id: 8458814a-d1fc-4ade-ae03-9966028768da
status: stable
description: Detects STP Root Bridge Attack network attack
author: Thor Security Team
date: 2025/03/01
modified: 2025/06/15
tags:
    - attack.lateral_movement
    - attack.t1557
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
    condition: selection
falsepositives:
    - Network testing tools
level: high
