title: Network Lateral - HTTP Protocol Downgrade
id: c173c86f-0898-41d2-a9bd-c043cd08ec81
status: stable
description: Detects HTTP Protocol Downgrade network attack
author: Thor Security Team
date: 2025/03/01
modified: 2025/06/15
tags:
    - attack.lateral_movement
    - attack.t1557
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
    condition: selection
falsepositives:
    - Network testing tools
level: high
