title: Cleartext Protocol / Amplification - ldap_amplify
id: 62cdb17e-7501-484a-abda-1363547f1e7b
status: stable
description: Detects insecure or abused protocol usage: ldap_amplify
author: Thor Security Team
date: 2024/08/01
modified: 2025/03/10
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Protocol: 'tcp'
    condition: selection
falsepositives:
    - Legacy systems requiring old protocols
level: low
