title: Cleartext Protocol / Amplification - chargen_amplify
id: c40befe4-6acf-4ffd-804c-36ae424f8277
status: stable
description: Detects insecure or abused protocol usage: chargen_amplify
author: Thor Security Team
date: 2024/08/01
modified: 2025/03/10
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Protocol: 'tcp'
    condition: selection
falsepositives:
    - Legacy systems requiring old protocols
level: low
