title: Cleartext Protocol / Amplification - tftp_abuse
id: ff5e2c84-e912-401c-8d14-748472a71620
status: stable
description: Detects insecure or abused protocol usage: tftp_abuse
author: Thor Security Team
date: 2024/08/01
modified: 2025/03/10
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Protocol: 'tcp'
    condition: selection
falsepositives:
    - Legacy systems requiring old protocols
level: low
