title: Cleartext Protocol / Amplification - snmp_v1
id: ef0a63f4-5422-41bc-84b0-fa9ddc12d51f
status: stable
description: Detects insecure or abused protocol usage: snmp_v1
author: Thor Security Team
date: 2024/08/01
modified: 2025/03/10
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Protocol: 'tcp'
    condition: selection
falsepositives:
    - Legacy systems requiring old protocols
level: low
