title: Cleartext Protocol / Amplification - mssql_scan
id: 7998783e-83b2-4f27-af2a-3214866ef22e
status: stable
description: Detects insecure or abused protocol usage: mssql_scan
author: Thor Security Team
date: 2024/08/01
modified: 2025/03/10
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Protocol: 'tcp'
    condition: selection
falsepositives:
    - Legacy systems requiring old protocols
level: low
