title: Cleartext Protocol / Amplification - rsh_rlogin
id: c71d64dc-be70-4669-bb0c-90e92ca9038b
status: stable
description: Detects insecure or abused protocol usage: rsh_rlogin
author: Thor Security Team
date: 2024/08/01
modified: 2025/03/10
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Protocol: 'tcp'
    condition: selection
falsepositives:
    - Legacy systems requiring old protocols
level: low
