title: Cleartext Protocol / Amplification - memcached_amplify
id: 4070eb32-9852-42ec-ba81-8c9518705957
status: stable
description: Detects insecure or abused protocol usage: memcached_amplify
author: Thor Security Team
date: 2024/08/01
modified: 2025/03/10
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Protocol: 'tcp'
    condition: selection
falsepositives:
    - Legacy systems requiring old protocols
level: low
