title: Cleartext Protocol / Amplification - smtp_open_relay
id: ac1163e0-ace2-4e4d-ba8f-ab0c11fa8b96
status: stable
description: Detects insecure or abused protocol usage: smtp_open_relay
author: Thor Security Team
date: 2024/08/01
modified: 2025/03/10
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Protocol: 'tcp'
    condition: selection
falsepositives:
    - Legacy systems requiring old protocols
level: low
