title: Cleartext Protocol / Amplification - dns_amplify
id: c654a0d2-0329-4ec1-9ba5-a6c488aeb025
status: stable
description: Detects insecure or abused protocol usage: dns_amplify
author: Thor Security Team
date: 2024/08/01
modified: 2025/03/10
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Protocol: 'tcp'
    condition: selection
falsepositives:
    - Legacy systems requiring old protocols
level: low
