title: Network Port Scan - idle_scan
id: 426675e0-ed34-4bd2-972e-d8a408a49448
status: stable
description: Detects idle_scan network reconnaissance technique
author: Thor Security Team
date: 2024/10/15
modified: 2025/04/01
tags:
    - attack.discovery
    - attack.t1046
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        CommandLine|contains: 'nmap'
    condition: selection
falsepositives:
    - Authorized network scanning by security team
level: medium
