title: Network Port Scan - aggressive_scan
id: 4cfcfa3e-cadd-41b6-8612-a9a3261c3f24
status: stable
description: Detects aggressive_scan network reconnaissance technique
author: Thor Security Team
date: 2024/10/15
modified: 2025/04/01
tags:
    - attack.discovery
    - attack.t1046
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        CommandLine|contains: 'nmap'
    condition: selection
falsepositives:
    - Authorized network scanning by security team
level: medium
