title: Network C2 - SMB-based C2 Communication
id: 31278d5e-3203-4e83-a801-0067f8ff6c12
status: stable
description: Detects SMB-based C2 Communication network communication
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.command_and_control
    - attack.t1071.002
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        Initiated: 'true'
        DestinationPort:
            - 53
            - 443
            - 80
            - 8080
            - 8443
        CommandLine|contains:
            - 'named_pipe.*C2'
    condition: selection
falsepositives:
    - Legitimate network monitoring tools
level: high
