title: Tunneling/Proxy Detection - localtunnel
id: bb8d2e18-37b4-4527-bd0e-f6e0a4ebc3f3
status: stable
description: Detects suspicious tunneling or proxy usage via localtunnel
author: Thor Security Team
date: 2025/01/15
modified: 2025/06/01
tags:
    - attack.command_and_control
    - attack.t1090
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        CommandLine|contains: 'localtunnel'
    condition: selection
falsepositives:
    - VPN administrators
level: medium
