title: Tunneling/Proxy Detection - ngrok_tunnel
id: fd835821-84c0-4908-acef-5c0b82105d0b
status: stable
description: Detects suspicious tunneling or proxy usage via ngrok_tunnel
author: Thor Security Team
date: 2025/01/15
modified: 2025/06/01
tags:
    - attack.command_and_control
    - attack.t1090
logsource:
    category: network_connection
    product: linux
detection:
    selection:
        CommandLine|contains: 'ngrok_tunnel'
    condition: selection
falsepositives:
    - VPN administrators
level: medium
