title: Generic Ransomware Indicator 2
id: afe7906b-6f0f-4a45-a31f-ef5d1f2764d6
status: stable
description: Detects generic ransomware behavior indicator 2
author: Thor Security Team
date: 2025/05/01
modified: 2025/06/15
tags:
    - attack.impact
    - attack.t1486
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'encrypt'
            - '.locked'
            - 'ransom'
    condition: selection
falsepositives:
    - Legitimate encryption software
level: high
