title: AWS Security - API Gateway Unauthorized Exposure
id: 844456aa-c173-4cb0-944a-8948147100de
status: stable
description: Detects API Gateway Unauthorized Exposure in AWS CloudTrail logs
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.defense_evasion
    - cloud
    - attack.t1190
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'aws.amazonaws.com'
    condition: selection
falsepositives:
    - Authorized cloud administrators
    - Automated infrastructure management
level: high
