title: AWS Security - Cognito Identity Pool Abuse
id: ed93d84b-fa13-4ddc-95a1-a5114477f77b
status: stable
description: Detects Cognito Identity Pool Abuse in AWS CloudTrail logs
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.defense_evasion
    - cloud
    - attack.t1556
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'aws.amazonaws.com'
    condition: selection
falsepositives:
    - Authorized cloud administrators
    - Automated infrastructure management
level: high
