title: AWS Security - AWS CodeBuild Abuse
id: 20a92b55-110e-4889-b3d4-14329b052506
status: stable
description: Detects AWS CodeBuild Abuse in AWS CloudTrail logs
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.defense_evasion
    - cloud
    - attack.t1072
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'aws.amazonaws.com'
    condition: selection
falsepositives:
    - Authorized cloud administrators
    - Automated infrastructure management
level: high
