title: AWS Security - AWS Secrets Manager Dump
id: c4f94460-523f-40ee-87cc-538320a71ad7
status: stable
description: Detects AWS Secrets Manager Dump in AWS CloudTrail logs
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.defense_evasion
    - cloud
    - attack.t1555
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'aws.amazonaws.com'
    condition: selection
falsepositives:
    - Authorized cloud administrators
    - Automated infrastructure management
level: high
