title: AWS Security - AWS Config Service Disabled
id: 24922bb5-fe36-40d9-bc71-1bfcb25d9aa1
status: stable
description: Detects AWS Config Service Disabled in AWS CloudTrail logs
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.defense_evasion
    - cloud
    - attack.t1562.008
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'aws.amazonaws.com'
    condition: selection
falsepositives:
    - Authorized cloud administrators
    - Automated infrastructure management
level: high
