title: AWS Security - AWS Shield Protection Disabled
id: 7f41ef37-c5cc-4550-b79a-c18ad59e73eb
status: stable
description: Detects AWS Shield Protection Disabled in AWS CloudTrail logs
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.defense_evasion
    - cloud
    - attack.t1562
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'aws.amazonaws.com'
    condition: selection
falsepositives:
    - Authorized cloud administrators
    - Automated infrastructure management
level: high
