title: AWS Security - Lambda Execution Role Abuse
id: 9e4c9b25-e961-415c-a021-9a27ffccf758
status: stable
description: Detects Lambda Execution Role Abuse in AWS CloudTrail logs
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.defense_evasion
    - cloud
    - attack.t1578
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'aws.amazonaws.com'
    condition: selection
falsepositives:
    - Authorized cloud administrators
    - Automated infrastructure management
level: high
