title: AWS Security - RDS Snapshot Shared Publicly
id: cad41ae6-7c36-4014-96dc-43b9e282f4b4
status: stable
description: Detects RDS Snapshot Shared Publicly in AWS CloudTrail logs
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.defense_evasion
    - cloud
    - attack.t1530
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'aws.amazonaws.com'
    condition: selection
falsepositives:
    - Authorized cloud administrators
    - Automated infrastructure management
level: high
