title: AWS Security - AWS VPC Flow Log Deleted
id: 3c65b90d-b747-4596-a74c-d9c73cac16b3
status: stable
description: Detects AWS VPC Flow Log Deleted in AWS CloudTrail logs
author: Thor Security Team
date: 2024/09/01
modified: 2025/05/01
tags:
    - attack.defense_evasion
    - cloud
    - attack.t1070.008
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'aws.amazonaws.com'
    condition: selection
falsepositives:
    - Authorized cloud administrators
    - Automated infrastructure management
level: high
