title: Azure Security - Azure Container Registry Public
id: 55bf9ca5-38b1-4cae-abaf-a9d770160787
status: stable
description: Detects Azure Container Registry Public in Azure Activity Logs
author: Thor Security Team
date: 2024/10/01
modified: 2025/05/15
tags:
    - attack.cloud
    - attack.t1530
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName|contains: 'acr_public'
    condition: selection
falsepositives:
    - Authorized cloud operations
level: high
