title: Azure Security - Azure App Dangerous Role Assignment
id: 9d6c7253-b6b5-4cca-b29d-3703deeda79c
status: stable
description: Detects Azure App Dangerous Role Assignment in Azure Activity Logs
author: Thor Security Team
date: 2024/10/01
modified: 2025/05/15
tags:
    - attack.cloud
    - attack.t1098
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName|contains: 'app_role_assign'
    condition: selection
falsepositives:
    - Authorized cloud operations
level: high
