title: Azure Security - Azure DevOps Secret Variable Leak
id: 6f1632ac-8bf3-481d-8a30-98099db7e6ab
status: stable
description: Detects Azure DevOps Secret Variable Leak in Azure Activity Logs
author: Thor Security Team
date: 2024/10/01
modified: 2025/05/15
tags:
    - attack.cloud
    - attack.t1552
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        operationName|contains: 'devops_secret'
    condition: selection
falsepositives:
    - Authorized cloud operations
level: high
