title: Cloud Generic Threat Pattern 1
id: 712ff755-fc9a-452e-abf7-6949e8b3fc75
status: stable
description: Detects cloud environment threat pattern 1 involving unauthorized access or configuration changes
author: Thor Security Team
date: 2025/04/01
modified: 2025/06/15
tags:
    - attack.cloud
    - attack.t1078.004
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        errorCode: 'AccessDenied'
        userAgent|contains: 'python-requests'
    condition: selection
falsepositives:
    - Misconfigured applications
level: medium
