title: Cloud Generic Threat Pattern 10
id: ceb6cadb-6de2-42f4-b199-c39d1758a49c
status: stable
description: Detects cloud environment threat pattern 10 involving unauthorized access or configuration changes
author: Thor Security Team
date: 2025/04/01
modified: 2025/06/15
tags:
    - attack.cloud
    - attack.t1078.004
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        errorCode: 'AccessDenied'
        userAgent|contains: 'python-requests'
    condition: selection
falsepositives:
    - Misconfigured applications
level: medium
