title: GCP Security - GCP Cloud Shell Abuse
id: 0eb561d3-0966-40cc-897f-a780cdf2c1c4
status: stable
description: Detects GCP Cloud Shell Abuse in GCP Audit Logs
author: Thor Security Team
date: 2024/11/01
modified: 2025/06/01
tags:
    - attack.cloud
    - attack.t1059
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        protoPayload.methodName|contains: 'cloud_shell_abuse'
    condition: selection
falsepositives:
    - Authorized GCP administrators
level: high
