title: GCP Security - GCP Custom Role with Dangerous Perms
id: 71d5f00f-3c50-4d21-89e6-157d053764e8
status: stable
description: Detects GCP Custom Role with Dangerous Perms in GCP Audit Logs
author: Thor Security Team
date: 2024/11/01
modified: 2025/06/01
tags:
    - attack.cloud
    - attack.t1098
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        protoPayload.methodName|contains: 'custom_role_create'
    condition: selection
falsepositives:
    - Authorized GCP administrators
level: high
