title: Kubernetes Security - K8s Admission Controller Bypass
id: 5477a0dc-6b7f-4e3b-b7da-95595b0d390d
status: stable
description: Detects K8s Admission Controller Bypass in Kubernetes audit logs
author: Thor Security Team
date: 2024/12/01
modified: 2025/06/15
tags:
    - attack.cloud
    - attack.containers
    - attack.t1562
logsource:
    product: kubernetes
    service: audit
detection:
    selection:
        objectRef.resource: 'pods'
        verb: 'create'
    condition: selection
falsepositives:
    - Authorized Kubernetes administrators
level: high
