title: Kubernetes Security - K8s Pod with hostPID
id: ceed0e94-3c2e-4b65-96b0-c2bc63e52707
status: stable
description: Detects K8s Pod with hostPID in Kubernetes audit logs
author: Thor Security Team
date: 2024/12/01
modified: 2025/06/15
tags:
    - attack.cloud
    - attack.containers
    - attack.t1611
logsource:
    product: kubernetes
    service: audit
detection:
    selection:
        objectRef.resource: 'pods'
        verb: 'create'
    condition: selection
falsepositives:
    - Authorized Kubernetes administrators
level: high
