title: Active Directory - ADRecon Execution
id: fdb08e02-6d78-43f0-84a7-73844459b837
status: stable
description: Detects ADRecon Execution against Active Directory infrastructure
author: Thor Security Team
date: 2024/07/01
modified: 2025/02/28
tags:
    - attack.discovery
    - attack.credential_access
    - attack.t1069
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'ADRecon'
            - 'Get-ADObject'
    condition: selection
falsepositives:
    - Authorized penetration testing
    - IT security audits
level: high
