title: Credential Dumping Tool - Get-PassHashes
id: d683bacb-4c54-4a1a-87a6-e15faf2c9dbe
status: stable
description: Detects the use of Get-PassHashes for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\Get-PassHashes.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'Get-PassHashes'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
