title: Credential Dumping Tool - wce
id: f0cb5464-93e9-4e69-8915-0d8aebe3ccdc
status: stable
description: Detects the use of wce for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\wce.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'wce'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
