title: Credential Dumping Tool - ntdsgrab
id: 9bf5a446-ae93-48df-a00d-cf2d3a70a77f
status: stable
description: Detects the use of ntdsgrab for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\ntdsgrab.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'ntdsgrab'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
