title: Credential Dumping Tool - procdump
id: 72d262d0-6884-4a94-857f-a0dc4d4c4355
status: stable
description: Detects the use of procdump for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\procdump.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'procdump'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
