title: Credential Dumping Tool - Invoke-NinjaCopy
id: fc6aed4c-252b-4792-ab03-b019e24601d4
status: stable
description: Detects the use of Invoke-NinjaCopy for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\Invoke-NinjaCopy.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'Invoke-NinjaCopy'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
