title: Credential Dumping Tool - LaZagne
id: b22ea3bd-1e96-4037-b575-c347dda0ad59
status: stable
description: Detects the use of LaZagne for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\LaZagne.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'LaZagne'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
