title: Credential Dumping Tool - Out-Minidump
id: 563f356e-98d6-4108-bf47-e2a87e613185
status: stable
description: Detects the use of Out-Minidump for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\Out-Minidump.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'Out-Minidump'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
