title: Credential Dumping Tool - gsecdump
id: 8d337bcb-af6e-4cc2-9b91-232588ec2021
status: stable
description: Detects the use of gsecdump for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\gsecdump.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'gsecdump'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
