title: Credential Dumping Tool - lsadump
id: acc0153f-0efd-4dc6-9bd0-7bac683772f9
status: stable
description: Detects the use of lsadump for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\lsadump.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'lsadump'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
