title: Credential Dumping Tool - fgdump
id: 2ad34d81-1e15-495d-856e-e3792a2e78bf
status: stable
description: Detects the use of fgdump for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\fgdump.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'fgdump'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
