title: Credential Dumping Tool - pwdump
id: a6defce7-740b-47a2-ba35-9285cf64f690
status: stable
description: Detects the use of pwdump for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\pwdump.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'pwdump'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
