title: Credential Dumping Tool - sekurlsa
id: a5937d27-aa81-494b-b473-c4785da02617
status: stable
description: Detects the use of sekurlsa for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\sekurlsa.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'sekurlsa'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
