title: Credential Dumping Tool - mimikatz
id: d86da13f-a64d-454d-855b-db7edab7abdb
status: stable
description: Detects the use of mimikatz for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\mimikatz.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'mimikatz'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
