title: Credential Dumping Tool - SAMDump2
id: 6bc80839-f9e8-4984-bc56-ff4f9f073dd9
status: stable
description: Detects the use of SAMDump2 for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\SAMDump2.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'SAMDump2'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
