title: Credential Dumping Tool - vssadmin
id: f0cb029e-dc44-4d42-8127-a6b93f1a5178
status: stable
description: Detects the use of vssadmin for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\vssadmin.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'vssadmin'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
