title: Credential Dumping Tool - ntdsutil
id: 9b3f655f-7a6d-41b1-a088-b5e6a5e2794e
status: stable
description: Detects the use of ntdsutil for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\ntdsutil.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'ntdsutil'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
