title: Credential Dumping Tool - Invoke-Mimikatz
id: 47fa6afe-7cd4-4a8e-aab9-6060308776e4
status: stable
description: Detects the use of Invoke-Mimikatz for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\Invoke-Mimikatz.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'Invoke-Mimikatz'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
