title: Credential Dumping Tool - DumpCreds
id: 2ff07403-b16b-41d8-9a5e-5e3df54c3ee9
status: stable
description: Detects the use of DumpCreds for credential dumping from Windows systems
author: Thor Security Team
date: 2024/11/01
modified: 2025/04/01
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\DumpCreds.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'DumpCreds'
    condition: 1 of selection*
falsepositives:
    - Legitimate security testing by pentesters
level: critical
