title: Defense Evasion - CLR Injection
id: bf0789d9-9f31-44ef-b226-602e17b04da5
status: stable
description: Detects CLR Injection defense evasion technique on Windows
author: Thor Security Team
date: 2024/04/01
modified: 2025/02/01
tags:
    - attack.defense_evasion
    - attack.t1055.012
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'unmanaged.*CLR'
            - 'ICLRRuntimeHost'
    condition: selection
falsepositives:
    - Security software testing
level: high
