title: Defense Evasion - Process PPID Spoofing
id: f0b7a8f6-78d2-42a6-9d02-db420ccf1646
status: stable
description: Detects Process PPID Spoofing defense evasion technique on Windows
author: Thor Security Team
date: 2024/04/01
modified: 2025/02/01
tags:
    - attack.defense_evasion
    - attack.t1134.004
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'CreateProcess.*STARTUPINFOEX'
            - 'lpAttributeList'
    condition: selection
falsepositives:
    - Security software testing
level: high
