title: Windows Discovery Command - netstat -ano
id: 561e6ab2-4caa-4d61-9cee-22c59b2ef794
status: stable
description: Detects use of 'netstat -ano' for system/network discovery
author: Thor Security Team
date: 2024/12/01
modified: 2025/04/15
tags:
    - attack.discovery
    - attack.t1082
    - attack.t1016
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: 'netstat -ano'
    filter_legitimate:
        ParentImage|contains:
            - '\explorer.exe'
    condition: selection and not filter_legitimate
falsepositives:
    - System administrators running diagnostic commands
level: low
