title: Windows Discovery Command - Get-ADDomain
id: 919064c3-0b9d-49d4-8531-3071a7e2e62f
status: stable
description: Detects use of 'Get-ADDomain' for system/network discovery
author: Thor Security Team
date: 2024/12/01
modified: 2025/04/15
tags:
    - attack.discovery
    - attack.t1082
    - attack.t1016
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: 'Get-ADDomain'
    filter_legitimate:
        ParentImage|contains:
            - '\explorer.exe'
    condition: selection and not filter_legitimate
falsepositives:
    - System administrators running diagnostic commands
level: low
