title: Windows Discovery Command - systeminfo
id: a83e4d15-23a2-4bd6-9b27-89fdbf69069a
status: stable
description: Detects use of 'systeminfo' for system/network discovery
author: Thor Security Team
date: 2024/12/01
modified: 2025/04/15
tags:
    - attack.discovery
    - attack.t1082
    - attack.t1016
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: 'systeminfo'
    filter_legitimate:
        ParentImage|contains:
            - '\explorer.exe'
    condition: selection and not filter_legitimate
falsepositives:
    - System administrators running diagnostic commands
level: low
