title: Windows Discovery Command - whoami /all
id: 00e06c79-f8f2-40aa-bb0f-09c2e27a8892
status: stable
description: Detects use of 'whoami /all' for system/network discovery
author: Thor Security Team
date: 2024/12/01
modified: 2025/04/15
tags:
    - attack.discovery
    - attack.t1082
    - attack.t1016
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: 'whoami /all'
    filter_legitimate:
        ParentImage|contains:
            - '\explorer.exe'
    condition: selection and not filter_legitimate
falsepositives:
    - System administrators running diagnostic commands
level: low
