title: Lateral Movement - Remote WMI Execution
id: be7ca952-01b2-4782-b85d-a46342e6af63
status: stable
description: Detects Remote WMI Execution lateral movement technique
author: Thor Security Team
date: 2024/08/15
modified: 2025/01/20
tags:
    - attack.lateral_movement
    - attack.t1047
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'wmic /node:'
            - 'process call create'
    condition: selection
falsepositives:
    - Legitimate remote administration
level: high
