title: LOLBAS Abuse via regsvcs
id: 270d0439-6583-494e-9888-8333b7a725c8
status: stable
description: Detects abuse of legitimate Windows binary regsvcs for malicious purposes (Living off the Land)
author: Thor Security Team
date: 2024/09/01
modified: 2025/02/10
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\regsvcs.exe'
        CommandLine|contains:
            - 'http'
            - 'ftp'
            - '/e:javascript'
            - 'scrobj'
    filter:
        ParentImage|contains:
            - '\explorer.exe'
            - '\services.exe'
    condition: selection and not filter
falsepositives:
    - Legitimate administrative use
level: medium
