title: LOLBAS Abuse via mshta
id: 14f5f628-5dd6-4e5e-88b1-9de0d5878eb4
status: stable
description: Detects abuse of legitimate Windows binary mshta for malicious purposes (Living off the Land)
author: Thor Security Team
date: 2024/09/01
modified: 2025/02/10
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\mshta.exe'
        CommandLine|contains:
            - 'http'
            - 'ftp'
            - '/e:javascript'
            - 'scrobj'
    filter:
        ParentImage|contains:
            - '\explorer.exe'
            - '\services.exe'
    condition: selection and not filter
falsepositives:
    - Legitimate administrative use
level: medium
