title: LOLBAS Execution - installutil
id: 192bed6a-02e5-443b-a4f1-00b14bd4da63
status: stable
description: Detects abuse of installutil binary for code execution
author: Thor Security Team
date: 2025/05/01
modified: 2025/06/15
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\installutil.exe'
        CommandLine|contains:
            - 'http'
            - '/e:'
            - 'calc'
            - '-f '
    condition: selection
falsepositives:
    - Legitimate administrative use
level: medium
