title: LOLBAS Abuse via makecab
id: d360c0b0-abfb-4c26-9e4f-ace03bb11f58
status: stable
description: Detects abuse of legitimate Windows binary makecab for malicious purposes (Living off the Land)
author: Thor Security Team
date: 2024/09/01
modified: 2025/02/10
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\makecab.exe'
        CommandLine|contains:
            - 'http'
            - 'ftp'
            - '/e:javascript'
            - 'scrobj'
    filter:
        ParentImage|contains:
            - '\explorer.exe'
            - '\services.exe'
    condition: selection and not filter
falsepositives:
    - Legitimate administrative use
level: medium
