title: LOLBAS Abuse via installutil
id: cd010bbc-eb27-42db-810e-bf923020ae76
status: stable
description: Detects abuse of legitimate Windows binary installutil for malicious purposes (Living off the Land)
author: Thor Security Team
date: 2024/09/01
modified: 2025/02/10
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\installutil.exe'
        CommandLine|contains:
            - 'http'
            - 'ftp'
            - '/e:javascript'
            - 'scrobj'
    filter:
        ParentImage|contains:
            - '\explorer.exe'
            - '\services.exe'
    condition: selection and not filter
falsepositives:
    - Legitimate administrative use
level: medium
