title: LOLBAS Abuse via pcalua
id: 08ec6be2-adc7-41fe-901c-805623360a39
status: stable
description: Detects abuse of legitimate Windows binary pcalua for malicious purposes (Living off the Land)
author: Thor Security Team
date: 2024/09/01
modified: 2025/02/10
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\pcalua.exe'
        CommandLine|contains:
            - 'http'
            - 'ftp'
            - '/e:javascript'
            - 'scrobj'
    filter:
        ParentImage|contains:
            - '\explorer.exe'
            - '\services.exe'
    condition: selection and not filter
falsepositives:
    - Legitimate administrative use
level: medium
