title: LOLBAS Execution - vsjitdebugger_exec
id: 745e4f0d-d4e3-4829-8e2b-a93066c27c7c
status: stable
description: Detects abuse of vsjitdebugger_exec binary for code execution
author: Thor Security Team
date: 2025/05/01
modified: 2025/06/15
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\vsjitdebugger_exec.exe'
        CommandLine|contains:
            - 'http'
            - '/e:'
            - 'calc'
            - '-f '
    condition: selection
falsepositives:
    - Legitimate administrative use
level: medium
