title: LOLBAS Execution - makecab_exec
id: 087b431c-931e-4cf4-b40a-c9daa6cd7a03
status: stable
description: Detects abuse of makecab_exec binary for code execution
author: Thor Security Team
date: 2025/05/01
modified: 2025/06/15
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\makecab_exec.exe'
        CommandLine|contains:
            - 'http'
            - '/e:'
            - 'calc'
            - '-f '
    condition: selection
falsepositives:
    - Legitimate administrative use
level: medium
