title: PowerShell Obfuscation Pattern - _NonInteractive
id: b88d243f-d06a-4016-a90a-c907aa5f1a86
status: stable
description: Detects PowerShell using obfuscation or bypass technique involving -NonInteractive
author: Thor Security Team
date: 2024/10/01
modified: 2025/03/01
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059.001
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains: '-NonInteractive'
    filter_admin:
        User|contains:
            - 'SYSTEM'
    condition: selection and not filter_admin
falsepositives:
    - Legitimate PowerShell automation scripts
    - System management tasks
level: high
