title: PowerShell Obfuscation Pattern - WebClient
id: 8a4c5f76-2fe2-4a26-88e4-f26e279ff5b9
status: stable
description: Detects PowerShell using obfuscation or bypass technique involving WebClient
author: Thor Security Team
date: 2024/10/01
modified: 2025/03/01
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059.001
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains: 'WebClient'
    filter_admin:
        User|contains:
            - 'SYSTEM'
    condition: selection and not filter_admin
falsepositives:
    - Legitimate PowerShell automation scripts
    - System management tasks
level: high
