title: PowerShell Obfuscation Pattern - System_Reflection
id: 4d63c5f9-5468-4889-826c-7676eceb2123
status: stable
description: Detects PowerShell using obfuscation or bypass technique involving System.Reflection
author: Thor Security Team
date: 2024/10/01
modified: 2025/03/01
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059.001
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains: 'System.Reflection'
    filter_admin:
        User|contains:
            - 'SYSTEM'
    condition: selection and not filter_admin
falsepositives:
    - Legitimate PowerShell automation scripts
    - System management tasks
level: high
