title: PowerShell Obfuscation Pattern - _nop_
id: e746fd24-d6c5-44a6-990e-09fae3158c7b
status: stable
description: Detects PowerShell using obfuscation or bypass technique involving -nop 
author: Thor Security Team
date: 2024/10/01
modified: 2025/03/01
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059.001
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains: '-nop '
    filter_admin:
        User|contains:
            - 'SYSTEM'
    condition: selection and not filter_admin
falsepositives:
    - Legitimate PowerShell automation scripts
    - System management tasks
level: high
