title: PowerShell Obfuscation Pattern - Net_WebClient
id: 70a5035d-cab0-4ed4-a29a-d8458d01f013
status: stable
description: Detects PowerShell using obfuscation or bypass technique involving Net.WebClient
author: Thor Security Team
date: 2024/10/01
modified: 2025/03/01
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059.001
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains: 'Net.WebClient'
    filter_admin:
        User|contains:
            - 'SYSTEM'
    condition: selection and not filter_admin
falsepositives:
    - Legitimate PowerShell automation scripts
    - System management tasks
level: high
