title: PowerShell Obfuscation Pattern - Start_BitsTransfer
id: 5d37de90-90df-4c4e-932d-825f1527ee12
status: stable
description: Detects PowerShell using obfuscation or bypass technique involving Start-BitsTransfer
author: Thor Security Team
date: 2024/10/01
modified: 2025/03/01
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059.001
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains: 'Start-BitsTransfer'
    filter_admin:
        User|contains:
            - 'SYSTEM'
    condition: selection and not filter_admin
falsepositives:
    - Legitimate PowerShell automation scripts
    - System management tasks
level: high
