title: UAC Bypass via eventvwr
id: def31e14-d81e-44ad-b1cf-271219c417a1
status: stable
description: Detects UAC bypass technique using eventvwr auto-elevation
author: Thor Security Team
date: 2024/03/01
modified: 2025/01/10
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\eventvwr.exe'
        ParentImage|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
    filter_expected:
        ParentImage|contains: '\system32\'
    condition: selection and not filter_expected
falsepositives:
    - Administrative tasks
level: high
