title: UAC Bypass via sdclt
id: 112b12db-5f63-4716-b351-a323f9e4c4b9
status: stable
description: Detects UAC bypass technique using sdclt auto-elevation
author: Thor Security Team
date: 2024/03/01
modified: 2025/01/10
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\sdclt.exe'
        ParentImage|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
    filter_expected:
        ParentImage|contains: '\system32\'
    condition: selection and not filter_expected
falsepositives:
    - Administrative tasks
level: high
