title: UAC Bypass via computerdefaults
id: e7600cdd-409b-42a5-952d-6b293df4a18a
status: stable
description: Detects UAC bypass technique using computerdefaults auto-elevation
author: Thor Security Team
date: 2024/03/01
modified: 2025/01/10
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\computerdefaults.exe'
        ParentImage|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
    filter_expected:
        ParentImage|contains: '\system32\'
    condition: selection and not filter_expected
falsepositives:
    - Administrative tasks
level: high
