title: UAC Bypass via compMgmtLauncher
id: a9a93e5b-f351-4a44-a506-de3b194c66e9
status: stable
description: Detects UAC bypass technique using compMgmtLauncher auto-elevation
author: Thor Security Team
date: 2024/03/01
modified: 2025/01/10
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\compMgmtLauncher.exe'
        ParentImage|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
    filter_expected:
        ParentImage|contains: '\system32\'
    condition: selection and not filter_expected
falsepositives:
    - Administrative tasks
level: high
